app/Models/CommonModel.php

SELECT COUNT(*) AS `numrows`
FROM `saiyoojyam_inmates`
WHERE `inmates_rooms` = '54'
AND   (
`inmates_check_in_date` < '9999-12-31'
AND    (
`inmates_check_out_date` > '2026-09-15'
OR `inmates_check_out_date` IS NULL
OR `inmates_check_out_date` = ''
OR `inmates_check_out_date` = '0000-00-00'
  )
 )
---
    public function CountInmatesInRoomOnDate($room_id,$new_check_in,$new_check_out,$capacity)
    {

        if (empty($new_check_out) || $new_check_out === '0000-00-00') {

            $new_check_out = '9999-12-31';
        }

        $builder = $this->db->table('saiyoojyam_inmates')
            ->where('inmates_rooms', $room_id)
            ->groupStart()

                ->where('inmates_check_in_date <', $new_check_out)
                ->groupStart()
                    ->where('inmates_check_out_date >', $new_check_in)
                    ->orWhere('inmates_check_out_date IS NULL')
                    ->orWhere('inmates_check_out_date', '')
                    ->orWhere('inmates_check_out_date', '0000-00-00')
                ->groupEnd()
            ->groupEnd();

        $count = $builder->countAllResults();

SELECT *
FROM `saiyoojyam_inmates`
ORDER BY CASE WHEN inmates_status = "active" THEN 0 ELSE 1 END ASC, `inmates_name` ASC
---
    public function FetchInmatesActiveFirst($cond = array()){

        $query = $this->db->table('saiyoojyam_inmates');

        if(!empty($cond)){

            $query->where($cond);

        }

        $query->orderBy('CASE WHEN inmates_status = "active" THEN 0 ELSE 1 END', 'ASC', false)
            ->orderBy('inmates_name', 'ASC');

        return $query->get()->getResult();

UPDATE `saiyoojyam_inmates` SET `inmates_status` = 'checked_out'
WHERE `inmates_check_out_date` != '0000-00-00'
AND `inmates_check_out_date` < '2026-09-18'
AND `inmates_status` != 'checked_out'
---
    public function AutoCheckoutInmates(){

        $this->db->table('saiyoojyam_inmates')
        ->where('inmates_check_out_date !=', '0000-00-00')
        ->where('inmates_check_out_date <', date('Y-m-d'))
        ->where('inmates_status !=', 'checked_out')
        ->set('inmates_status', 'checked_out')
        ->update();

SELECT *
FROM `saiyoojyam_building`
ORDER BY `building_id` ASC
---
public function RoomsCategory(){

    $query = $this->db->table('saiyoojyam_building')
        ->select('*')
        ->orderBy('building_id', 'ASC');
        $result = $query->get()->getResult();

SELECT COUNT(*) AS `numrows`
FROM `saiyoojyam_inmates`
WHERE `inmates_rooms` = '101'
AND `inmates_check_in_date` <= '2026-09-18'
AND   (
`inmates_check_out_date` > '2026-09-18'
OR `inmates_check_out_date` IS NULL
OR `inmates_check_out_date` = ''
 )
---
public function fetchAvaliableRooms($room_id,$check_in_date){

    return $this->db->table('saiyoojyam_inmates')
        ->where('inmates_rooms', $room_id)
        ->where('inmates_check_in_date <=', $check_in_date)
        ->groupStart()
            ->where('inmates_check_out_date >', $check_in_date)
            ->orWhere('inmates_check_out_date IS NULL')
            ->orWhere('inmates_check_out_date', '')
        ->groupEnd()
        ->countAllResults();

SELECT *
FROM `saiyoojyam_inmates`
WHERE DATE_FORMAT(inmates_check_in_date, '%Y') <= 2026
AND   (
`inmates_status` != 'checked_out'
OR DATE_FORMAT(inmates_check_out_date, '%Y') >= 2026
 )
ORDER BY CASE WHEN inmates_status = "active" THEN 0 ELSE 1 END ASC, `inmates_name` ASC
---
public function inmatesMonthRent($date_start,$date_end){

    $currentYear = date('Y',strtotime($date_start));

    $query = $this->db->table('saiyoojyam_inmates')

    ->where("DATE_FORMAT(inmates_check_in_date, '%Y') <= $currentYear", NULL, FALSE)

    ->groupStart()
        ->where('inmates_status !=', 'checked_out')
        ->orWhere("DATE_FORMAT(inmates_check_out_date, '%Y') >= $currentYear", NULL, FALSE)
    ->groupEnd()

    ->orderBy('CASE WHEN inmates_status = "active" THEN 0 ELSE 1 END', 'ASC', false)

    ->orderBy('inmates_name', 'ASC');

    $result = $query->get()->getResult();

SELECT *
FROM `saiyoojyam_inmates`
LEFT JOIN `saiyoojyam_rooms` ON `saiyoojyam_inmates`.`inmates_rooms` = `saiyoojyam_rooms`.`rooms_id`
LEFT JOIN `saiyoojyam_room_type` ON `saiyoojyam_inmates`.`inmates_room_type` = `saiyoojyam_room_type`.`room_type_id`
LEFT JOIN `saiyoojyam_building` ON `saiyoojyam_inmates`.`inmates_building` = `saiyoojyam_building`.`building_id`
WHERE `inmates_building` = '1'
AND `inmates_check_in_date` <= '2026-08-31'
AND   (
`inmates_status` != 'checked_out'
OR `inmates_check_out_date` >= '2026-08-01'
OR `inmates_check_out_date` IS NULL
OR `inmates_check_out_date` = '0000-00-00'
OR `inmates_check_out_date` = ''
 )
ORDER BY `inmates_name` ASC
SELECT *
FROM `saiyoojyam_tariffs`
WHERE `tariffs_building` = '1'
AND `tariffs_rooms` = '1'
---
public function inmatesBuilding($month, $year, $cond, $statusFilter = 'all'){

    $month_num = sprintf('%02d', (int)$month);
    $target_month_date = "$year-$month_num-01";
    $target_month_end  = date('Y-m-t', strtotime($target_month_date));

    $builder = $this->db->table('saiyoojyam_inmates')
        ->where($cond)
        ->where('inmates_check_in_date <=', $target_month_end)
        ->groupStart()
            ->where('inmates_status !=', 'checked_out')
            ->orWhere('inmates_check_out_date >=', $target_month_date)
            ->orWhere('inmates_check_out_date IS NULL')
            ->orWhere('inmates_check_out_date', '0000-00-00')
            ->orWhere('inmates_check_out_date', '')
        ->groupEnd()
        ->orderBy('inmates_name', 'ASC')
        ->join('saiyoojyam_rooms', 'saiyoojyam_inmates.inmates_rooms = saiyoojyam_rooms.rooms_id', 'left')
        ->join('saiyoojyam_room_type', 'saiyoojyam_inmates.inmates_room_type = saiyoojyam_room_type.room_type_id', 'left')
        ->join('saiyoojyam_building', 'saiyoojyam_inmates.inmates_building = saiyoojyam_building.building_id', 'left');

    $inmates = $builder->get()->getResult();

    $result = [];

    foreach($inmates as $inmate){
        $tariff = $this->db->table('saiyoojyam_tariffs')
            ->where('tariffs_building', $inmate->inmates_building)
            ->where('tariffs_rooms', $inmate->inmates_rooms)
            ->get()->getRow();

SELECT *
FROM `saiyoojyam_invoice`
WHERE `invoice_inmates` = '105'
AND   (
`invoice_payment_month` = '2026-08-01'
OR `invoice_payment_month` = '2026-08-01'
 )
ORDER BY `invoice_id` DESC
---
            $lookup_month_date = date('Y-m-01', strtotime('+1 month', strtotime($target_month_date)));
        }

        $invoice = $this->db->table('saiyoojyam_invoice')
            ->where('invoice_inmates', $inmate->inmates_id)
            ->groupStart()
                ->where('invoice_payment_month', $lookup_month_date)
                ->orWhere('invoice_payment_month', $target_month_date)
            ->groupEnd()
            ->orderBy('invoice_id', 'DESC')
            ->get()->getRow();