app/Models/CommonModel.php

SELECT COUNT(*) AS `numrows`
FROM `saiyoojyam_inmates`
WHERE `inmates_rooms` = '96'
AND   (
`inmates_check_in_date` < '9999-12-31'
AND    (
`inmates_check_out_date` > '2026-09-16'
OR `inmates_check_out_date` IS NULL
OR `inmates_check_out_date` = ''
OR `inmates_check_out_date` = '0000-00-00'
  )
 )
---
    public function CountInmatesInRoomOnDate($room_id,$new_check_in,$new_check_out,$capacity)
    {

        if (empty($new_check_out) || $new_check_out === '0000-00-00') {

            $new_check_out = '9999-12-31';
        }

        $builder = $this->db->table('saiyoojyam_inmates')
            ->where('inmates_rooms', $room_id)
            ->groupStart()

                ->where('inmates_check_in_date <', $new_check_out)
                ->groupStart()
                    ->where('inmates_check_out_date >', $new_check_in)
                    ->orWhere('inmates_check_out_date IS NULL')
                    ->orWhere('inmates_check_out_date', '')
                    ->orWhere('inmates_check_out_date', '0000-00-00')
                ->groupEnd()
            ->groupEnd();

        $count = $builder->countAllResults();

SELECT *
FROM `saiyoojyam_building`
ORDER BY `building_id` ASC
---
public function RoomsCategory(){

    $query = $this->db->table('saiyoojyam_building')
        ->select('*')
        ->orderBy('building_id', 'ASC');
        $result = $query->get()->getResult();

SELECT COUNT(*) AS `numrows`
FROM `saiyoojyam_inmates`
WHERE `inmates_rooms` = '95'
AND `inmates_check_in_date` <= '2026-09-03'
AND   (
`inmates_check_out_date` > '2026-09-03'
OR `inmates_check_out_date` IS NULL
OR `inmates_check_out_date` = ''
 )
---
public function fetchAvaliableRooms($room_id,$check_in_date){

    return $this->db->table('saiyoojyam_inmates')
        ->where('inmates_rooms', $room_id)
        ->where('inmates_check_in_date <=', $check_in_date)
        ->groupStart()
            ->where('inmates_check_out_date >', $check_in_date)
            ->orWhere('inmates_check_out_date IS NULL')
            ->orWhere('inmates_check_out_date', '')
        ->groupEnd()
        ->countAllResults();